Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །བྱང་ཆུབ་སེམས་དཔའ་འདུག་མ་ཐག་ཏུ་ཁང་བཟངས་ཐམས་ཅད་ཀྱང་འོད་ཀྱིས་གསལ་བར་གྱུར་ཏོ།
en: As soon as the Bodhisattva stepped foot on the palace floor, the entire palace became illuminated with light.

source: །དེ་ནས་རྒྱལ་པོ་སད་པ་དང་། འོད་དེ་མཐོང་སྟེ་མཐོང་ནས་ཀྱང་མྱུར་བ་མྱུར་བར་ཉུང་རུམ་ལ་སྨྲས་པ། ཀྱེ་ཉུང་རུམ་ཅི་ཉི་མ་ཤར་ཏམ།
en: The king woke up and, when he saw the light, he promptly asked his chamberlain, “Did the sun rise?

source: གང་གིས་ན་འདི་འོད་ཀྱིས་རྣམ་པར་མཛེས།
en: It is such a beautiful light!”

source: ཉུང་རུམ་གྱིས་སྨྲས་པ། ལྷ་ད་དུང་དུ་དགུང་ཕྱེད་ཀྱང་མ་བས་སོ།
en: His chamberlain replied, “No, my lord, it is still the middle of the night.” He continued:

source: །ལྷ་གཞན་ཡང་ཉི་མའི་འོད་ནི་ཤིང་དང་རྩིག་པ་ཐལ་མི་ཕྱིན།
en: “My lord, the light of the sun causes trees and walls to cast shadows;

source: །ལུས་ལ་གདུང་བར་བགྱིད་ཅིང་ཚ་བར་རབ་ཏུ་བགྱིད།
en: It torments and overheats the body.

source: །ནང་པར་དུས་ན་ངང་པ་དག་དང་རྨ་བྱ་དང་། །ནེ་ཚོ་ཁུ་བྱུག་ངུར་པ་དག་ཀྱང་རང་སྒྲ་འབྱིན།
en: Also swans, peacocks, parrots, cuckoos, and wild ducks Call out at the time of dawn.

source: །འོད་འདི་ལྷ་མིའི་ཡིད་དུ་མཆི་ཞིང་བདེ་བ་སྟེ།
en: “However, Your Majesty, this light is lovely and pleasant.

source: །རབ་ཏུ་སིམ་བགྱིད་དགེ་བགྱིད་གདུང་བར་བགྱིད་མ་ལགས།
en: It is soothing, auspicious, and does not burn;

source: །ཤིང་དང་རྩིག་པ་ཐལ་ཕྱུང་སྒྲིབ་པ་ཡོང་མ་མཆིས།
en: It penetrates trees and walls and casts no shadow.

source: །ཡོན་ཏན་ལྡན་པ་གཅིག་ཅིག་དེང་ནི་འདིར་བྱོན་ངེས།
en: Someone with great qualities must have arrived here.”

source: །རྒྱལ་པོ་དེ་ནི་མི་དགའ་ཕྱོགས་བཅུར་བལྟས་པ་དང་། །སེམས་ཅན་དག་པ་པད་མའི་མིག་ཅན་དེ་མཐོང་ནས།
en: The king, worried, looked all around, And saw the pure being with eyes like lotuses.

source: །དེ་ནི་མལ་ནས་ལྡང་བར་འདོད་ན་མ་ནུས་ཏེ།
en: He tried to get up from his bed, but did not succeed;

source: །རྣམ་དག་བློ་ཅན་དམ་པ་ཕ་ལ་གུས་པ་བསྐྱེད།
en: The noble one with pure heart then felt respect for his father.

source: །དེ་ནི་རྒྱལ་པོའི་མདུན་དུ་འདུག་ནས་འདི་སྐད་སྨྲས།
en: Standing in front of the king, he said,

source: །ལྷ་ཅིག་བདག་ནི་མངོན་པར་འབྱུང་བའི་དུས་བབ་རིགས།
en: “My lord, now the time is right for me to leave home;

source: །བགེགས་ཀྱང་མ་མཛད་མི་དགྱེས་པ་ཡང་མ་མཛད་ཅིག །རྒྱལ་པོ་གཉེན་བཅས་ཡུལ་འཁོར་བཅས་ཏེ་བཟོད་པར་གསོལ།
en: Please do not hinder me and don’t be distraught. My king, may you, my family, and the people of the kingdom forgive me.”

source: །རྒྱལ་པོ་དེ་ནི་མཆི་མས་མིག་གང་འདི་སྐད་སྨྲས།
en: The king replied with tears filling his eyes,

source: །ཁྱོད་ནི་ཕྱིར་ལྡོག་པ་ཡི་དགོས་པ་ཅི་ཞིག་ཡོད།
en: “What will it take for you to change your mind? Will you ask me for a boon?

source: །བདག་ལ་དམ་པ་ཅི་སློང་སྨྲོས་ཤིག་ཐམས་ཅད་སྦྱིན།
en: Tell me, I will give you anything!

source: །བདག་དང་ཕོ་བྲང་འཁོར་དང་ཡུལ་འཁོར་འདི་ཕན་ཐོགས།
en: I am yours, and you can have the palace, the servants, and this whole kingdom.”

source: །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔས་སྙན་པའི་ཚིག་སྨྲས་པ།
en: Then, in a sweet voice, the Bodhisattva replied,

source: ལྷ་ཅིག་དམ་པ་བཞི་འཚལ་དེ་ནི་བདག་ལ་སྩོལ།
en: “My lord, I wish for four boons. Please grant them to me!

source: །གལ་ཏེ་སྩལ་བར་སྤྱོད་ན་མངའ་ནི་ཁྱོད་ལ་མཆིས།
en: If you are able to give them to me, you will have power over me.

source: །འོན་ཏང་རྟག་ཏུ་ཁྱིམ་ན་གཟིམས་ཤིང་འབྱུང་མི་འགྱུར།
en: You will always see me here at home and I will not depart.

source: །ལྷ་ཅིག་བདག་ནི་རྒ་བས་ཚུགས་པར་མི་འགྱུར་ཞིང་།
en: “I want, my lord, to be unharmed by old age;

source: །རྟག་ཏུ་མདོག་བཟང་དར་ལ་བབ་པར་གནས་པ་དང་། །ནད་མ་མཆིས་པ་ཐོབ་ཅིང་ནད་ཀྱིས་མི་བཏབ་དང་། །ཚེ་དཔག་མ་མཆིས་པ་དང་རྒུད་པར་མི་འགྱུར་འཚལ།
en: To retain my fine complexion and youth forever; To be healthy and without disease; And to have infinite life without death ever coming.”

source: །རྒྱལ་པོས་ཚིག་ཐོས་ཤིན་ཏུ་སྡུག་བསྔལ་ཉམ་ཐག་སྟེ།
en: When the king heard these words, he felt extremely sad.

source: །གཞོན་ནུ་གནས་མིན་སློང་བས་བདག་ལ་མཐུ་མེད་དོ།
en: “My son, you are asking for the impossible; I am powerless here.

source: །བསྐལ་པར་གནས་པའི་དྲང་སྲོང་རྣམས་ཀྱང་ནམ་དུ་ཡང་།
en: Even the sages who live for eons are not beyond

source: །རྒ་ན་འཆི་བའི་འཇིགས་དང་རྒུད་ལས་མ་ཐར་ཏོ།
en: Degeneration and the dreads of sickness, old age, and dying.”

source: །རྒ་ན་འཆི་བའི་འཇིགས་དང་རྒུད་པར་མི་འགྱུར་བ། །ལྷ་ཅིག་གལ་ཏེ་མཆོག་བཞི་འདི་དག་མི་སྩོལ་ན། །
en: “My lord, if you cannot give me these four boons— Freedom from misfortune and the terrors of sickness, old age, and dying—Then I request of you another boon.

source: གཞན་ཡང་མཆོག་ཅིག་གསོལ་གྱིས་རྒྱལ་པོ་གསན་དུ་གསོལ།
en: Please listen, Your Majesty:

source: །འདི་ནས་ཤི་འཕོས་ཉིང་མཚམས་སྦྱོར་བར་མི་འགྱུར་མཛོད།
en: I wish that, after I die, I will not have to take rebirth again.”

source: །མི་ཡི་དམ་པའི་ཚིག་ནི་དེ་སྐད་ཐོས་པ་དང་། །སྲེད་པ་བསྲབས་ཏེ་བུ་ལ་ཆགས་པ་ཡོངས་སུ་གཅོད།
en: When the king heard these words from the best among men, He diminished his longing, let go of his attachment for his son, and said,

source: །ཕན་བྱེད་འགྲོ་བ་ཐར་བྱེད་རྗེས་སུ་ཡི་རང་ངོ་། །ཁྱོད་ཀྱི་བསམ་པ་རྣམས་ནི་ཡོངས་སུ་རྫོགས་གྱུར་ཅིག །
en: “Then go and benefit and liberate beings. I rejoice in that. May all your wishes be fulfilled.”

source: དགེ་སློང་དག་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སླར་སོང་སྟེ། རང་གི་ཁྱིམ་དུ་ཕྱིན་ནས་མལ་ན་འདུག་པ་དང་། དེ་སོང་བའམ་འོངས་པར་སུས་ཀྱང་མ་ཚོར་རོ།
en: Monks, then the Bodhisattva left and went to his own residence, where he lay down on his bed. No one had even noticed that he had left.

source: །དགེ་སློང་དག་དེའི་ནམ་ནངས་པ་དང་། རྒྱལ་པོ་ཟས་གཙང་མས་ཤཱཀྱའི་ཚོགས་ཐམས་ཅད་བསོགས་ཏེ་དེའི་ལོ་རྒྱུས་རྣམས་སྨོས་ནས།
en: Monks, at daybreak King Śuddhodana gathered the entire Śākya clan and announced,

source: གཞོན་ནུ་ནི་མངོན་པར་འབྱུང་ན་ད་ཇི་ལྟར་བྱ་ཞེས་སྨྲས་སོ།
en: “The prince wants to abandon his home. What shall we do?”

source: །ཤཱཀྱ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་བསྲུང་བར་བགྱིའོ། །
en: The Śākyas replied, “Your Majesty, let us guard him.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། ཤཱཀྱའི་ཚོགས་འདི་ནི་མང་ལ།
en: There are many of us in the Śākya clan, and he is alone.

source: དེ་ནི་གཅིག་པུར་གྱུར་པས་མཐུས་མངོན་པར་འབྱུང་བའི་ནུས་པ་དེ་ལ་མ་མཆིས་སོ།
en: He will not be able to leave home.”

source: །དེ་ནས་ཤཱཀྱ་དེ་དག་དང་རྒྱལ་པོ་ཟས་གཙང་མས་ཤཱཀྱ་གཞོན་ནུ་འཐབ་ཆོས་སྦྱངས་པ། འོས་སུ་གྱུར་པ། འཕོང་བསླབས་པ། ཚན་པོ་ཆེ་ཆེན་པོའི་སྟོབས་དང་ལྡན་པ་ལྔ་བརྒྱ་བྱང་ཆུབ་སེམས་དཔའ་བསྲུང་བའི་ཕྱིར་གྲོང་ཁྱེར་གྱི་ཤར་སྒོར་བཀོད་དེ། བྱང་ཆུབ་སེམས་དཔའ་བསྲུང་བའི་ཕྱིར་ཤཱཀྱ་གཞོན་ནུ་རེ་རེ་ལ་ཡང་འཁོར་ཤིང་རྟ་ལྔ་བརྒྱ་ལྔ་བརྒྱ་དང་། ཤིང་རྟ་རེ་རེ་ལ་ཡང་འཁོར་དཔུང་བུ་ཆུང་ལྔ་བརྒྱ་ལྔ་བརྒྱ་བཀོད་དོ།
en: Thereafter the Śākyas and King Śuddhodana placed five hundred young men by the eastern city gate to guard the Bodhisattva. All the men were armed, trained in combat, skilled in archery and javelin throwing, and were as strong as powerful wrestlers. In order to further guard the Bodhisattva, each of the young Śākya men had five hundred chariots at their disposal, and along with each chariot were five hundred infantrymen.

source: །བྱང་ཆུབ་སེམས་དཔའ་བསྲུང་བའི་ཕྱིར། དེ་བཞིན་དུ་གྲོང་ཁྱེར་གྱི་ལྷོ་དང་ནུབ་དང་བྱང་གི་སྒོར་ཡང་ཤཱཀྱ་གཞོན་ནུ་འཐབ་ཆོས་སྦྱངས་པ་འོས་སུ་གྱུར་པ།
en: Likewise they placed five hundred young men by the southern, western, and northern city gates to guard the Bodhisattva.

source: འཕོང་བསླབས་པ་ཚན་པོ་ཆེ་ཆེན་པོའི་སྟོབས་དང་ལྡན་པ་ལྔ་བརྒྱ་ལྔ་བརྒྱ་དང་། ཤཱཀྱ་གཞོན་ནུ་རེ་རེ་ལ་ཡང་འཁོར་ཤིང་རྟ་ལྔ་བརྒྱ་ལྔ་བརྒྱ་དང་། ཤིང་རྟ་རེ་རེ་ལ་ཡང་འཁོར་དཔུང་བུ་ཆུང་ལྔ་བརྒྱ་ལྔ་བརྒྱ་བཀོད་དོ།
en: All the men were armed, trained in combat, skilled in archery and javelin throwing, and were as strong as powerful wrestlers. In order to further guard the Bodhisattva, each of the young Śākya men had five hundred chariots at their disposal, and along with each chariot were five hundred infantrymen.

source: །བྱང་ཆུབ་སེམས་དཔའ་བསྲུང་བའི་ཕྱིར་ཤཱཀྱ་རྒན་རབས་རྒན་རབས་རྣམས་ཀྱང་ལམ་གྱི་བཞི་མདོ་དང་། སུམ་མདོ་དང་། ལམ་པོ་ཆེ་མང་པོ་ཐམས་ཅད་ན་གདོད་ཅིང་འཁོད་དོ།
en: The elders of the Śākya clan, both male and female, were also placed everywhere at road intersections, junctions, and many highways in order to guard the Bodhisattva.

source: །རྒྱལ་པོ་ཟས་གཙང་མ་ཡང་ཤཱཀྱ་གཞོན་ནུ་ལྔ་བརྒྱས་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ཏེ། རྟ་དང་གླང་པོ་ཆེ་དག་ལ་ཞོན་ནས་རང་གི་ཁྱིམ་སྒོ་ན་མེལ་ཚེ་བྱེད་དོ།
en: Even King Śuddhodana kept watch at the palace gate, accompanied by five hundred young Śākyas mounted on elephants and horses.

source: །སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱིས་ཀྱང་རང་གི་བྲན་མོའི་ཚོགས་ལ་སྨྲས་པ།
en: Mahāprajāpatī Gautamī said to her servants:

source: མར་མེ་དྲི་མ་མེད་པ་བུས་ལ་ནོར་བུ་ཐམས་ཅད་རྒྱལ་མཚན་རྩེ་མོར་ཐོགས།
en: “Light bright lamps and fasten all jewels to the peak of the banners!

source: །མུ་ཏིག་རྒྱན་ཕྲེང་རྣམས་ཀྱང་སྤྱངས་ལ་ཁྱིམ་འདི་ཀུན་ཏུ་འོད་ཀྱིས་སྣང་བར་བྱོས།
en: Hang garlands of pearls and illuminate this entire palace!

source: །གླུ་དབྱངས་དག་ཀྱང་སྦྱོར་ལ་དོ་མོད་གཡེལ་བ་མེད་པར་མེལ་ཚེ་དམ་དུ་གྱིས།
en: Play music, sing songs, and stay awake and alert through the night.

source: །གཞོན་ནུ་ཅི་ནས་མ་ཚོར་བར་ནི་འགྲོ་བར་མི་འགྱུར་ཚུལ་དུ་བསྲུང་བ་གྱིས།
en: Guard the prince so that he cannot leave without anybody knowing. “Arm yourselves!

source: །གོ་བགོས་ལག་ན་ལག་ཆ་རལ་གྲི་དང་། །མདུང་ཐུང་མདའ་དང་མཚོན་ཆ་རྩེ་གཉིས་ཐོགས།
en: Carry in your hands weapons— Swords and lances, bows and arrows, and two-pointed spears—

source: །སྡུག་པའི་བུ་ནི་བསྲུང་བར་བྱ་བའི་ཕྱིར།
en: To guard our beloved prince.

source: །ཀུན་ཀྱང་རབ་ཏུ་བསྒྲིམ་པ་ཆེན་པོ་གྱིས།
en: Everyone must be on high alert!

source: །སྒོ་ཀུན་ཆོད་ལ་གཏན་པར་དམ་དུ་ཆུད།
en: “First shut all doors, then lock them tight

source: །སྒོ་འཕར་སྲ་བ་རྐེད་པར་གཏན་ཆུག་ལ།
en: And place door bolts firmly across the door panels.

source: །དུས་ལ་མ་བབ་པར་ནི་སྒོ་མ་དབྱེ།
en: Unless you must, do not open any door,

source: །སེམས་ཅན་དམ་པ་འདི་ནི་ཤོར་ཏ་རེ།
en: Otherwise this noble being might escape.

source: །ནོར་བུ་དོ་ཤལ་མུ་ཏིག་དོ་ཤལ་ཐོགས།
en: “Adorn yourselves with necklaces of jewels and pearls;

source: །མེ་ཏོག་ཟླ་གམ་སེང་གེ་ཤིང་ལོ་རིས།
en: Wear flower ornaments, half-moon ornaments, and chains.

source: །སྐ་རགས་སོར་གདུབ་རྣ་རྒྱན་ཆིངས་ཤིང་ཐོགས།
en: Adorn yourselves with belts, rings, and earrings;

source: །རྐང་གདུབ་དག་ཀྱང་ཤིན་ཏུ་ལེགས་པར་ཐོགས།
en: Take care to fasten your anklets well.

source: །ལྷ་མི་ཕན་པ་གླང་པོ་དྲེགས་བཞིན་འགྲོ། །གལ་ཏེ་བློ་བུར་མངོན་པར་བྱུང་ད་རེ།
en: “Should this benefactor of humans and gods, who acts like a proud elephant, Try to escape in a hasty manner,

source: །ཅི་ནས་མི་བདེ་རྙེད་པར་མ་གྱུར་པར།
en: You should confront him in such a way

source: །དེ་ལྟ་དེ་ལྟར་ནན་ཏན་ཆེར་གྱིས་ཤིག །
en: That no harm is done to him.

source: བུད་མེད་གང་དག་མདུང་ཐུང་ཐོགས་པ་དག །དྲི་མ་མེད་པ་མལ་ན་འདུག་པ་བསྐོར། །ཅི་ནས་གཉིད་ཀྱིས་ལོག་པར་མ་གྱུར་པར། །ཕྱེ་མ་ལེབ་བཞིན་མིག་གིས་བསྲུང་བར་གྱིས།
en: “You girls with lances in your hands, Who surround the bed of this pure being, You must not slip into laziness, But watch him with eyes like a butterfly.

source: །རྒྱལ་བུ་འདི་ནི་བསྲུང་བར་བྱ་བའི་ཕྱིར།
en: “In order to guard the prince,

source: །ཁྱིམ་འདིར་རིན་པོ་ཆེ་ཡི་དྲ་བ་བྲེས།
en: Adorn this palace with bejeweled lattices

source: །གླིང་བུ་དག་ཀྱང་རབ་ཏུ་འབུད་ཅིང་ལོང་།
en: And take up your flutes and play them to your fullest.

source: །དོ་མོད་རྡུལ་དང་བྲལ་བ་བསྲུང་བ་གྱིས།
en: Protect the Stainless Being through the night!

source: །ཕན་ཚུན་གཅིག་ལ་གཅིག་ནི་སྦྲོན་བྱོས་ཏེ།
en: “Keep each other awake And do not take rest.

source: །དོ་མོད་མ་ཉལ་ཤིན་ཏུ་བསྲུང་བ་གྱིས།
en: Otherwise he may certainly leave his home behind,

source: །རྒྱལ་སྲིད་དང་ནི་ཡུལ་འཁོར་སྤངས་ནས་སུ།
en: Abandoning the kingdom and all his subjects.

source: །ཁྱིམ་ནས་མངོན་དུ་འབྱུང་བར་གྱུར་ཏ་རེ།
en: “If he were to leave his home,

source: །འདི་ནི་མངོན་པར་བྱུང་བར་གྱུར་ན་གོ། །རྒྱལ་པོའི་ཕོ་བྲང་འདི་ཀུན་ཉམས་མི་དགའ། །རྒྱལ་པོའི་རིགས་རྒྱུད་ཡུན་རིང་གནས་པ་ཡང་།།རྒྱལ་པོའི་རིགས་དང་རྒྱུད་ནི་ཆད་པར་འགྱུར།
en: Then the royal palace would become a place with no joy. The continuity of the royal lineage, which has endured so long, Would become interrupted.”

source: །དགེ་སློང་དག་དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ལྔ་རྩེན་ལ་སོགས་པ་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་དང་། འཕྲོག་མའི་བུ་ལྔ་བརྒྱ་རྣམས་གཅིག་ཏུ་འདུས་ནས་འདི་སྐད་ཅེས་སྨྲས་ཏེ།
en: Monks, at that point the twenty-eight great yakṣa generals, such as Pāñcika, met with the five hundred sons of Hārītī and voiced their concern:

source: གྲོགས་པོ་དག་དོ་མོད་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་འབྱུང་གིས་ཁྱེད་ཅག་དེ་ལ་མཆོད་པ་བྱེད་པའི་ལས་ལ་སྤྲོ་བགྱིས་ཤིག །རྒྱལ་པོ་ཆེན་པོ་བཞི་ཡང་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་དུ་ཞུགས་ནས་གནོད་སྦྱིན་གྱི་འཁོར་ཆེན་པོ་ལ་སྨྲས་པ། གྲོགས་པོ་དག་དོ་མོད་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་འབྱུང་གིས་ཁྱེད་ཀྱིས་བཅིབས་པའི་རྐང་ལག་ནས་ཐེག་ལ་འབྱུང་བར་གྱིས་ཤིག །གནོད་སྦྱིན་གྱི་འཁོར་གྱིས་སྨྲས་པ།
en: “Friends, tonight the Bodhisattva will leave his home. So you should delight in making offerings to him.” Likewise the Four Great Kings, who had entered the Aḍakavatī Palace, told the great gathering of yakṣas, “Friends, tonight the Bodhisattva will leave his home. You must help him leave by carrying the hooves of his fine horse with your hands.” The gathering of yakṣas responded:

source: སྐུ་ནི་སྲེད་མེད་བུ་ཡི་སྟོབས་ལྡན་རྡོ་རྗེ་ལྟ་བུར་མི་ཕྱེད་སྲ་ལ་ལྕི།
en: “Hard as vajra, and indestructible with a body as powerful as Nārāyaṇa’s,

source: །སེམས་ཅན་ཀུན་གྱི་དམ་པ་དེ་ནི་བརྩོན་འགྲུས་སྟོབས་ལྡན་གཡོ་བ་མི་མངའ་སྟེ།
en: Diligent and strong, this perfect man cannot be moved.

source: །རི་ཡི་དམ་པ་ལྷུན་པོ་ཆེན་པོ་རྨང་ནས་ཕྱུང་སྟེ་ནམ་མཁར་གཟུང་ནུས་ཀྱི།
en: Although great Meru, the foremost mountain, may be lifted and held up in the sky,

source: །རྒྱལ་པོའི་ཡོན་ཏན་ལྷུན་པོ་རི་ལྕི་བསོད་ནམས་ཡེ་ཤེས་གནས་པ་སུས་ཀྱང་གང་དུ་བཀུར་མི་ནུས།
en: No one can lift the mountain of a victor’s qualities, founded on merit and wisdom.”

source: །རྣམ་ཐོས་ཀྱི་བུས་སྨྲས་པ།
en: Vaiśravaṇa said:

source: མི་གང་ང་རྒྱལ་འགྱིང་བ་དེ་ལ་སྟོན་པ་ལྕི།
en: “For people bloated with pride, this teacher will be heavy;

source: །གང་དག་དགའ་གུས་གནས་པ་དེ་དག་ཡང་བར་ཚོར།
en: For those who are loving and respectful, he will be light.

source: །བསམ་པ་ཐག་པས་བརྩོན་པར་བྱོས་ལ་གུས་པ་ཡིས།
en: If from your heart you devote yourself to him with respect,

source: །བྱ་ཡིས་ཤ་ཁམ་བཞིན་དུ་ཡང་བར་ཤེས་པར་གྱིས།
en: You will find him as light as a tuft of cotton is to birds.

source: །ཁོ་བོ་མདུན་ནས་འགྲོ་ཡིས་ཁྱེད་ཅག་རྣམས་ཀྱིས་བཅིབས་པ་ཐེག །བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་འབྱུང་ཚེ་བསོད་ནམས་མང་པོ་སྩོགས།
en: “I will walk in front, while you will carry his horse. When the Bodhisattva leaves, we shall gather vast amounts of merit!”

source: །དགེ་སློང་དག་དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ལ་སྨྲས་པ།
en: Monks, then Śakra, lord of the gods, spoke to the gods in the Heaven of the Thirty-Three:

source: ཀྱེ་གྲོགས་པོ་དག་དོ་མོད་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་འབྱུང་གིས་དེ་ལ་ཁྱེད་ཐམས་ཅད་མཆོད་པའི་ལས་ལ་སྤྲོ་བར་གྱིས་ཤིག །
en: “Friends, tonight the Bodhisattva will leave his home. So you should delight in making offerings to him.”

source: དེ་ན་ལྷའི་བུ་ཞི་བའི་བློ་གྲོས་ཞེས་བྱ་བ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ། །བདག་གིས་ནི་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་སྐྱེས་པ་དང་། བུད་མེད་དང་ཁྱེའུ་དང་བུ་མོ་ཐམས་ཅད་གཉིད་ཀྱིས་ལོག་པར་བགྱིའོ། །
en: The god Śāntamati replied, “I will cause all men, women, and children in the city of Kapilavastu to fall asleep.”

source: ལྷའི་བུ་རྩེ་བ་བཀོད་པ་ཞེས་བྱ་བ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ། །བདག་གིས་ནི་རྟ་དང་གླང་པོ་ཆེ་དང་། བོང་བུ་དང་། རྔ་མོ་དང་། བ་ལང་དང་། མ་ཧེ་དང་། སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་རྣམས་ཀྱི་སྒྲ་མི་གྲག་པར་བགྱིའོ། །
en: The god Lalitavyūha offered, “I will silence all sounds from horses, elephants, donkeys, camels, cows, buffaloes, women, men, boys, and girls.”

source: ལྷའི་བུ་བཀོད་པའི་བློ་གྲོས་ཞེས་བྱ་བ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ། །བདག་གིས་ནི་ནམ་མཁའི་དཀྱིལ་དུ་ཤིང་རྟ་ཆེན་པོ་བདུན་རིན་པོ་ཆེའི་སྟེགས་བུས་འཁོར་བར་བསྐོར་བ་ནོར་བུ་རིན་པོ་ཆེ་མེ་ཤེལ་གྱི་འོད་འབར་བ། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་བསྒྲེང་བ། མེ་ཏོག་སྣ་ཚོགས་ཆལ་པར་བཀྲམ་པ། པོག་ཕོར་ནས་བདུག་སྤོས་སྣ་ཚོགས་ཀྱིས་བདུགས་པ་དག་བྱང་ཆུབ་སེམས་དཔའ་ལམ་གང་ནས་འབྱུང་བའི་ལམ་དེར་བཀོད་པར་བགྱིའོ།
en: Then the god Vyūhamati volunteered, “I will construct in midair a fabulous road seven chariots wide, flanked on both sides by jeweled platforms, blazing with the light of sunstone gems, shaded with raised parasols, flags, and banners, strewn with various flowers, and censed from incense burners of various fragrances. On this road the Bodhisattva will set forth.”

source: །ཀླུའི་རྒྱལ་པོ་ས་སྲུང་གི་བུ་ཞེས་བྱ་བས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the king of the elephants named Airāvaṇa spoke:

source: །བདག་གིས་བདག་ཉིད་ཀྱི་སྣ་ལ་ཁང་པ་བརྩེགས་པ་དཔག་ཚད་སུམ་ཅུ་རྩ་གཉིས་པ་བགྱིས་ཏེ་དེར་ལྷའི་བུ་མོ་དག་བཀོད་ལ་སིལ་སྙན་དང་། གླུ་དབྱངས་ལེན་དུ་སྩལ་ཅིང་གླུ་དང་རོལ་མོའི་དབྱངས་སྒྲ་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའ་ལ་རིམ་གྲོ་དང་བསྙེན་བཀུར་བགྱིད་ཅིང་མཆི་བར་བགྱིའོ།
en: “Upon my trunk I will erect a mansion thirty-two leagues tall. In that mansion divine maidens can assemble to serve and venerate the Bodhisattva by making music, singing songs, and playing instruments.”

source: །ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ཉིད་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁོ་བོས་ནི་སྒོ་དབྱེའོ། །ལམ་མཚོན་པར་བྱའོ།
en: Then Śakra, lord of the gods, himself said, “I will open the gates and show him the path.”

source: །ལྷའི་བུ་ཆོས་སྤྱོད་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །བདག་གིས་ནི་བཙུན་མོའི་འཁོར་རྣམས་མི་སྡུག་པར་བསྟན་པར་བགྱིའོ།
en: Next the god Dharmacārin said, “I will cause the retinue of consorts to look unappealing.”

source: །ལྷའི་བུ་ཡང་དག་སྐུལ་པོས་སྨྲས་པ།
en: Then the god Sañcodaka spoke:

source: བདག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་གཟིམས་མལ་ནས་བཞེངས་པར་གསོལ་བར་བགྱིའོ།
en: “I will help the Bodhisattva to rise from his bed.”

source: །དེ་ན་ཀླུའི་རྒྱལ་པོ་ཆུ་ལྷ་དང་། ཀླུའི་རྒྱལ་པོ་གཟི་ཅན་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་དང་། ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་བོས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Finally the nāga kings Varuṇa, Manasvin, Sāgara, Anavapta, Nanda, and Upananda spoke:

source: །བདག་ཅག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་དུས་ཀྱི་རྗེས་སུ་འབྲང་བའི་ཙན་དན་གྱི་སྤྲིན་མངོན་པར་སྤྲུལ་ཏེ། ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཕྱེ་མའི་ཆར་དབབ་པོ།
en: “We, for our part, will produce cloud banks of sandalwood and let a rain of sandalwood powder descend as offerings to the Bodhisattva.”

source: །དགེ་སློང་དག་དེ་ལྟར་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་རྣམས་ཀྱིས་རྣམ་པ་འདི་ལྟ་བུའི་བསམ་པ་ངེས་པར་བསམས་ཏེ་བརྩམས་སོ།
en: Monks, then all the gods, nāgas, yakṣas, and gandharvas set out to do what they had promised.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཆོས་སེམས་པ་ལ་ཞུགས་པ།
en: In the meanwhile the Bodhisattva’s mind was on the Dharma.

source: གླུ་དབྱངས་ལེན་པའི་ཁང་བཟངས་ན་མལ་བདེ་བ་ལ་འདུག་པ།
en: He was resting comfortably in the music hall, surrounded by his ladies.

source: བཙུན་མོའི་འཁོར་གྱི་ནང་ན་འདུག་པ་ནི་སྔོན་གྱི་སངས་རྒྱས་ཀྱི་སྤྱོད་པ་རྣམ་པར་སེམས་ཤིང་སེམས་ཅན་ལ་ཕན་པ་བྱ་བ་རྗེས་སུ་སེམས་ལ། སྔོན་གྱི་སྨོན་ལམ་གྱི་ཚིག་བཞི་མངོན་དུ་བྱེད་དོ། །བཞི་གང་ཞེ་ན།
en: As he reflected on the conduct of past buddhas and the way to benefit all sentient beings, he was thinking about four aspiration prayers that he had formed in the past:

source: སྔོན་ང་རང་བྱུང་གི་བདག་པོ་འདོད་ཅིང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོན་དུ་གཉེར་བ་ན།
en: “Previously I wished to become a self-appearing lord and pursue omniscience.

source: གོ་ཆ་འདི་ལྟ་བུ་བགོས་པར་གྱུར་ཏེ།
en: At that time I donned the armor of the following fourfold resolve.

source: སེམས་ཅན་སྡུག་བསྔལ་བ་དག་མཐོང་ནས་ཀྱེ་མའོ་བདག་གིས་འཇིག་རྟེན་གནས་པ་བཅིངས་ཏེ་འཁོར་བའི་བཙོན་ར་ཆེན་པོར་བཅུག་པ་ལ་འཁོར་བའི་བཙོན་ར་དྲལ་ཏེ། བཅིངས་པ་བཀྲོལ་བའི་སྒྲ་བསྒྲག་གོ།
en: “First, I have seen how sentient beings suffer. So may I free and liberate those who are bound to the world and caught in the prison of cyclic existence.

source: །སྲེད་པའི་ཞགས་པ་དང་། སྒྲོག་དམ་པོས་བཅིངས་པའི་སེམས་ཅན་རྣམས་ཀྱང་རབ་ཏུ་དགྲོལ་ལོ་ཞེས་བྱ་བ་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཚིག་དང་པོ་འདི་མངོན་དུ་གྱུར་ཏོ།
en: May I liberate sentient beings from the tight shackles and chains of craving.” Such was his first aspiration prayer from the past. Next he thought of his second aspiration prayer from the past:

source: །ཀྱེ་མའོ་བདག་གིས་འཇིག་རྟེན་མ་རིག་པའི་མུན་པ་མུན་གནག་ཐིབས་པོ་ཆེན་པོར་ཞུགས་པ་མི་ཤེས་པའི་ལིང་ཏོག་དང་རབ་རིབ་ཀྱིས་མིག་བསྒྲིབས་པ་ཤེས་རབ་ཀྱི་མིག་དང་བྲལ་བ། མ་རིག་པ་དང་གཏི་མུག་གིས་ལྡོངས་པ་ལ་ཆོས་ཀྱི་སྣང་བ་ཆེན་པོ་བྱ་ཞིང་ཡེ་ཤེས་ཀྱི་སྒྲོན་མ་ཡང་ཉེ་བར་བསྒྲུབས་ལ།
en: “May I shine the light of Dharma for those who are thrown deep into the darkness of great ignorance within the world—for the people whose eyes are obscured by the cataract of ignorance, who lack the eye of wisdom, and who are blind with ignorance and delusion. May I raise the lamp of wisdom, which destroys the darkness for those who are blinded by ignorance.

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ཤེས་པའི་མིག་སྨན་རི་ལུ་དང་སྨན་ཐབས་དང་ཤེས་རབ་དང་། ཡེ་ཤེས་དང་ལྡན་པ་བཏང་སྟེ།
en: May I apply the medicine of the three gateways to liberation—the remedy that employs means, wisdom, and knowledge.

source: མ་རིག་པའི་མུན་པ་མུན་གནག་དང་། གཏི་མུག་གི་མུན་པ་དང་། རབ་རིབ་དང་། ལིང་ཏོག་དང་། རྙོག་པ་ཐམས་ཅད་བསལ་ནས་ཤེས་རབ་ཀྱི་མིག་རྣམ་པར་སྦྱང་ངོ་ཞེས་བྱ་བ་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཚིག་གཉིས་པ་འདི་མངོན་དུ་གྱུར་ཏོ།
en: May I remove the darkness of ignorance and all cataracts and faults of dullness, and in this way purify their wisdom eye.” Then the Bodhisattva thought of his third aspiration prayer from the past:

source: །ཀྱེ་མའོ་བདག་གིས་འཇིག་རྟེན་ང་རྒྱལ་གྱི་རྒྱལ་མཚན་བསྒྲེང་བ། ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་ལ་མངོན་པར་ཞེན་པ། བདག་དང་བདག་གིར་འཛིན་པ་དང་ལྡན་པའི་ཡིད་ཅན། འདུ་ཤེས་དང་། སེམས་དང་། ལྟ་བ་ཕྱིན་ཅི་ལོག་གིས་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་བཟུང་བ་ངན་པས་ཟིན་པ་ལ་འཕགས་པའི་ལམ་བསྟན་ཏེ།
en: “Alas, this world has raised the banner of pride and egotism. It is obsessed with clinging to ‘I’ and ‘mine.’ People’s minds grasp at the self, and false notions of a self distort their views. May I bring down this banner of pride that thinks ‘I am’ by showing them the noble path.”

source: ངའོ་སྙམ་པའི་ང་རྒྱལ་བསྙལ་བར་བྱའོ་ཞེས་བྱ་བ་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཚིག་གསུམ་པ་འདི་མངོན་དུ་གྱུར་ཏོ།
en: Finally the Bodhisattva thought of his fourth aspiration prayer from the past:

source: །ཀྱེ་མའོ་བདག་གིས་འཇིག་རྟེན་རྣམ་པར་མ་ཞི་བ།
en: “Alas, this world is not at peace because of the self.

source: ཐགས་འཁྲུགས་པ་ལྟ་བུར་གྱུར་པ། དྲུ་གུ་འཛིངས་པ་ལྟ་བུར་གྱུར་པ།
en: The world is continually disturbed and is like a tangled mass of cords.

source: འོང་བ་དང་འགྲོ་བར་གྱུར་པ།
en: Beings come and go.

source: འཇིག་རྟེན་འདི་ནས་འཇིག་རྟེན་ཕ་རོལ་དང་། འཇིག་རྟེན་ཕ་རོལ་ནས་འཇིག་རྟེན་འདིར་ཀུན་ཏུ་རྒྱུག་ཅིང་འཁོར་ལ་འཁོར་བ་ལས་མི་ལྡོག་པ་མགལ་མེའི་འཁོར་ལོ་ལྟ་བུར་གྱུར་པ་ལ་ཉེ་བར་ཞི་བར་བྱེད་པའི་ཤེས་རབ་ཀྱིས་ཆོག་པར་བྱེད་པའི་ཆོས་ཀྱང་བསྟན་ཏོ་ཞེས་བྱ་བ་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཚིག་བཞི་པོ་འདི་མངོན་དུ་གྱུར་ཏེ།
en: They always move and circle back and forth between this world and the next. Their spinning around knows no end and resembles a firebrand’s circle. May I show them the Dharma of tranquility, which brings fulfillment through knowledge.”

source: སྔོན་གྱི་སྨོན་ལམ་གྱི་ཚིག་བཞི་པོ་དེ་དག་མངོན་དུ་གྱུར་ཏོ། །སྐད་ཅིག་དེ་ལ་ལྷའི་བུ་ཆོས་སྤྱོད་དང་། གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱིས་བཙུན་མོའི་འཁོར་མི་སྡུག་པར་བསྒྱུར་ཏེ།
en: Right then the god Dharmacārin and the gods of the pure realms made the retinue of consorts appear unappealing.

source: མི་སྡུག་པར་གནས་པ་དང་། སྨད་པའི་གཟུགས་སུ་བསྟན་ནས་ནམ་མཁའ་ལ་འཁོད་དེ། བྱང་ཆུབ་སེམས་དཔའ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: After the gods had revealed the consorts’ unpleasant and unattractive features, they took position in the sky and uttered the following verses:

source: དེ་ནས་ལྷའི་བུ་རྫུ་འཕྲུལ་ཆེ་རྣམས་ཀྱིས།
en: The gods who have great magical powers

source: །པད་མ་རྒྱས་པ་ཡངས་པའི་སྤྱན་ལ་སྨྲས།
en: Spoke to the One with Elongated Eyes like a Blooming Lotus:

source: །དུར་ཁྲོད་དབུས་འདིར་བཞུགས་པར་གྱུར་ལགས་ན། །ཁྱོད་ནི་ཇི་ལྟར་དགྱེས་པ་སྐྱེ་བར་འགྱུར།
en: “How can you be so delighted When living amid a cemetery?”

source: །ལྷ་ཡི་དབང་ཕྱུག་རྣམས་ཀྱིས་དེ་བསྐུལ་ནས།
en: Inspired by the lords of gods,

source: །ཡུད་ཙམ་བཙུན་མོའི་འཁོར་ལ་ལྟ་ཞིང་རྟོག །བལྟས་ནས་སྨད་པར་གྱུར་པ་དེ་དག་མཐོང་།
en: Immediately the Bodhisattva looked around and examined the retinue of consorts. Seeing that they had become repulsive,

source: །དུར་ཁྲོད་གནས་པར་གྱུར་པ་བདེན་སྙམ་བྱེད།
en: He thought, “It is true, I live amid a cemetery.”
